In [3]:
from pyspark import SparkContext
sc = SparkContext()
from pyspark.sql import SparkSession

spark = SparkSession \
   .builder \
   .appName("Python Spark regression example") \
   .config("spark.some.config.option", "some-value") \
   .getOrCreate()

In [5]:
df = spark.read.csv('titanic.csv',header=True, inferSchema = True)

In [6]:
df.show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [7]:
df.columns

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [12]:
df.groupby(df.Fare > 50).count().show()

+-----------+-----+
|(Fare > 50)|count|
+-----------+-----+
|       true|  160|
|      false|  731|
+-----------+-----+

In [14]:
df.filter(df.Age > 50).show()

+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|     Ticket|    Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----+--------+
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|      17463| 51.8625|  E46|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|     113783|   26.55| C103|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|     248706|    16.0| null|       S|
|         34|       0|     2|Wheadon, Mr. Edwa...|  male|66.0|    0|    0| C.A. 24579|    10.5| null|       S|
|         55|       0|     1|Ostby, Mr. Engelh...|  male|65.0|    0|    1|     113509| 61.9792|  B30|       C|
|         95|       0|     3|   Coxon, Mr. Daniel|  male|59.0|    0|    0|     364500|    7.25| null|       S|
|         97|       0|     1|Goldschmidt, Mr. ...|  male|71.0|    0|    0|   PC 17754| 34.6542|   A5|       C|
|        117|       0|     3|Connors, Mr. Patrick|  male|70.5|    0|    0|     370369|    7.75| null|       Q|
|        125|       0|     1|White, Mr. Perciv...|  male|54.0|    0|    1|      35281| 77.2875|  D26|       S|
|        151|       0|     2|Bateman, Rev. Rob...|  male|51.0|    0|    0|S.O.P. 1166|  12.525| null|       S|
|        153|       0|     3|    Meo, Mr. Alfonzo|  male|55.5|    0|    0| A.5. 11206|    8.05| null|       S|
|        156|       0|     1|Williams, Mr. Cha...|  male|51.0|    0|    1|   PC 17597| 61.3792| null|       C|
|        171|       0|     1|Van der hoef, Mr....|  male|61.0|    0|    0|     111240|    33.5|  B19|       S|
|        175|       0|     1|Smith, Mr. James ...|  male|56.0|    0|    0|      17764| 30.6958|   A7|       C|
|        196|       1|     1|Lurette, Miss. Elise|female|58.0|    0|    0|   PC 17569|146.5208|  B80|       C|
|        223|       0|     3|Green, Mr. George...|  male|51.0|    0|    0|      21440|    8.05| null|       S|
|        233|       0|     2|Sjostedt, Mr. Ern...|  male|59.0|    0|    0|     237442|    13.5| null|       S|
|        250|       0|     2|Carter, Rev. Erne...|  male|54.0|    1|    0|     244252|    26.0| null|       S|
|        253|       0|     1|Stead, Mr. Willia...|  male|62.0|    0|    0|     113514|   26.55|  C87|       S|
|        263|       0|     1|   Taussig, Mr. Emil|  male|52.0|    1|    1|     110413|   79.65|  E67|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----+--------+
only showing top 20 rows

In [15]:
df.describe()

DataFrame[summary: string, PassengerId: string, Survived: string, Pclass: string, Name: string, Sex: string, Age: string, SibSp: string, Parch: string, Ticket: string, Fare: string, Cabin: string, Embarked: string]

In [16]:
from pyspark.sql.functions import mean, min, max


df.select([mean('Age'), min('Age'), max('Age')]).show()

+-----------------+--------+--------+
|         avg(Age)|min(Age)|max(Age)|
+-----------------+--------+--------+
|29.69911764705882|    0.42|    80.0|
+-----------------+--------+--------+

In [17]:
df.select([mean('Fare'), min('Fare'), max('Fare')]).show()

+----------------+---------+---------+
|       avg(Fare)|min(Fare)|max(Fare)|
+----------------+---------+---------+
|32.2042079685746|      0.0| 512.3292|
+----------------+---------+---------+

## Grab All Values of Names In A Column

In [49]:
import pyspark.sql.functions as f

names_list = df.select(f.collect_list('Name')).first()[0]

first_name = names_list[0]
first_name

'Braund, Mr. Owen Harris'

## Using Reduce

In [50]:
from functools import reduce 

print(reduce(lambda val1, val2: val1 + val2, first_name))

Braund, Mr. Owen Harris

In [52]:
age_list = df.select(f.collect_list('Age')).first()[0]

top_two = age_list[0:2]
top_two

[22.0, 38.0]

In [53]:
print(reduce(lambda val1, val2: val1 + val2, top_two))

60.0